{
  "techspecs": {
    "screen": "Screen",
    "resolution": "Resolution",
    "processor": "Processor",
    "ram": "RAM",
    "capacity": "Built in memory",
    "camera": "Camera",
    "zoom": "Zoom",
    "cell": "Cell"
  },

  "navbar": {
    "home": "HOME",
    "phones": "PHONES",
    "tablets": "TABLETS",
    "accessories": "ACCESSORIES"
  },

  "footer": {
    "contacts": "contacts",
    "rights": "rights",
    "toTop": "Back to top"
  },

  "home": {
    "welcome": "Welcome to Nice Gadgets store!",
    "sliderNew": "Brand new models",
    "categories": "Categories",
    "sliderHot": "Hot prices",
    "models": "models"
  },

  "heroCard": {
    "available": "Now available",
    "inStore": "in our store!",
    "beFirst": "Be the first!",
    "orderNow": "Order Now"
  },

  "cartButton": {
    "add": "Add to cart",
    "added": "Added to cart"
  },

  "categories": {
    "mobPhones": "Mobile phones",
    "phon": "Phones",
    "tablets": "Tablets",
    "accessories": "Accessories",
    "favourites": "Favourites"
  },

  "catalog": {
    "newest": "Newest",
    "alphabetically": "Alphabetically",
    "cheapest": "Cheapest",
    "sortBy": "Sort by",
    "perPage": "Items on page",
    "models": "models",
    "items": "items"
  },

  "goBack": {
    "back": "Back"
  },

  "itemCard": {
    "about": "About",
    "specs": "Tech specs",
    "sliderLike": "You may also like",
    "colors": "Available colors",
    "capacity": "Select capacity"
  },

  "cart": {
    "cart": "Cart page",
    "save": "You save",
    "total": "Total for",
    "item": "item",
    "items": "items",
    "checkout": "Checkout",
    "notImplement": "What would you like to do?.",
    "wantClear": "Do you wan't to clear the Cart?",
    "cancel": "Order now",
    "yesClear": "Yes, clear the Cart!",
    "empty": "Your cart is empty"
  },

  "notFound": {
    "notFound": "Page not found :(",
    "home": "Home"
  },

  "favourites": {
    "empty": "You haven't liked anything yet"
  },

  "auth": {
    "auth": "Registration Page",
    "logIn": "Log In",
    "signIn": "Sign Up",
    "submit": "Submit",
    "name": "Name",
    "email": "Email",
    "password": "Password",
    "signInButton": "SignUp",
    "signInGoogleButton": "SignUp with Google",
    "logInButton": "LogIn",
    "logInGoogleButton": "LogIn with Google",
    "signout": "SignOut",
    "or": "or",
    "joinedOn": "Joined on ",
    "invalidName": "Name must contain only letters and be between 2 and 40 characters long.",
    "weakPassword": "Password must be at least 8 characters long and include at least one uppercase letter, one lowercase letter, one number, and one special character.",
    "exist": "User with this email already exist"
  },

  "order": {
    "info": "Please fill out the details to place an order",
    "close": "Close",
    "order": "Make an order"
  },

  "personName": {
    "Dmytro": "Dmytro Kolesnikov",
    "Tania": "Tetiana Radykhovska",
    "Kate": "Kate Piekharieva",
    "Sonia": "Sonia Pelenska"
  },

  "personDescription": {
    "Dmytro": "With experience as a Fullstack Developer, I build end-to-end web solutions that are responsive, accessible, and maintainable. My front-end work leverages React and Tailwind, while my backend experience includes PostgreSQL and Node.js. I use Redux Toolkit for handling application state, and tools like Git, Vite, and Webpack are part of my daily workflow. I value collaboration, clarity, and continuous growth.",
    "Tania": "I’m a Fullstack Engineer with a focus on intuitive design and efficient architecture. I build responsive web apps using React and Tailwind, manage complex states with Redux Toolkit, and develop backend features using Node.js and PostgreSQL. I’m fluent in modern dev tools like Git, Webpack, and Vite, and thrive in dynamic, Agile environments. I’m driven by learning and bringing ideas to life through clean code.",
    "Kate": "As a Fullstack Developer, I specialize in delivering responsive, user-friendly applications. My expertise spans React and Tailwind for front-end work, along with Redux Toolkit for state management. I’ve also gained hands-on experience with backend technologies like Node.js and PostgreSQL. I work well in Agile teams and enjoy using tools such as Git, Vite, and Webpack. I’m passionate about building scalable digital solutions and continuously improving my skills.",
    "Sonia": "I develop modern web applications as a Fullstack Developer, combining clean UI/UX with robust backend systems. I’ve built frontends using React and Tailwind CSS, and supported them with backend logic using Node.js and PostgreSQL. Redux Toolkit helps manage complex state in my projects. I’m familiar with Agile workflows and tools like Git, Vite, and Webpack. I enjoy evolving as a developer and transforming ideas into functional apps."
  },

  "rights": {
    "title": "Consumer Rights",
    "1": {
      "title": "Return and Exchange",
      "description": "You have the right to return or exchange a product within 14 days of purchase, provided it has not been used and retains its original condition."
    },
    "2": {
      "title": "Warranty",
      "description": "All devices come with a warranty ranging from 12 to 24 months depending on the model. In case of a manufacturing defect, we will provide free service or a replacement. The warranty does not cover physical damage, liquid exposure, or unauthorized repairs."
    },
    "3": {
      "title": "Intellectual Property",
      "description": "All images, product descriptions, logos, and texts on this website are the property of our company or the respective brands. It is prohibited to copy or use materials without written permission."
    },
    "4": {
      "title": "Liability",
      "description": "We are not responsible for any consequences resulting from improper use of devices or actions of third parties linked through our website."
    },
    "5": {
      "title": "Data Privacy",
      "description": "We respect your privacy. All personal information provided during checkout is used solely for order processing and is not shared with third parties."
    },
    "6": {
      "title": "Delivery Terms",
      "description": "Orders are delivered within 1–3 business days after confirmation. In case of delays, we will inform you in advance."
    },
    "7": {
      "title": "Payment",
      "description": "We accept online payments (credit/debit cards), cash on delivery, or payment upon receipt. All transactions are protected by modern security standards."
    },
    "8": {
      "title": "Contact Information",
      "description": "If you have questions regarding consumer rights, feel free to contact our support team at +380 (XX) XXX-XX-XX or email us at support@example.com."
    }
  }
}
