{
  "techspecs": {
    "screen": "Екран",
    "resolution": "Роздільна здатність",
    "processor": "Процесор",
    "ram": "Оперативна пам'ять",
    "capacity": "Вбудована пам'ять",
    "camera": "Камера",
    "zoom": "Зум",
    "cell": "Зв'язок"
  },

  "navbar": {
    "home": "ГОЛОВНА",
    "phones": "ТЕЛЕФОНИ",
    "tablets": "ПЛАНШЕТИ",
    "accessories": "АКСЕСУАРИ"
  },

  "footer": {
    "contacts": "контакти",
    "rights": "права",
    "toTop": "На гору"
  },

  "home": {
    "welcome": "Ласкаво просимо до магазину Nice Gadgets!",
    "sliderNew": "Найновіші моделі",
    "categories": "Категорії",
    "sliderHot": "Гарячі пропозиції",
    "models": "моделей"
  },

  "heroCard": {
    "available": "Вже в нашому",
    "inStore": "магазині!",
    "beFirst": "Будь першим!",
    "orderNow": "Замов Зараз"
  },

  "cartButton": {
    "add": "В кошик",
    "added": "В кошику"
  },

  "categories": {
    "mobPhones": "Мобільні телефони",
    "phon": "Телефони",
    "tablets": "Планшети",
    "accessories": "Аксесуари",
    "favourites": "Улюблені"
  },

  "catalog": {
    "newest": "Найновіші",
    "alphabetically": "За алфавітом",
    "cheapest": "Найдешевші",
    "sortBy": "Сортувати за",
    "perPage": "Штук на сторінці",
    "models": "моделей",
    "items": "продуктів"
  },

  "goBack": {
    "back": "Назад"
  },

  "itemCard": {
    "about": "Опис",
    "specs": "Характеристики",
    "sliderLike": "Вам також сподобається",
    "colors": "Доступні кольори",
    "capacity": "Виберіть місткість"
  },

  "cart": {
    "cart": "Кошик",
    "save": "Заощаджено",
    "total": "В сумі за",
    "item": "продукт",
    "items": "продукти",
    "checkout": "Оплата",
    "notImplement": "Оплата ще не реалізована",
    "wantClear": "Хочете очистити кошик?",
    "cancel": "Відміними",
    "yesClear": "Так, очистити кошик!",
    "empty": "Кошик порожній"
  },

  "notFound": {
    "notFound": "Сторінку не знайдено :(",
    "home": "На головну"
  },

  "favourites": {
    "empty": "Ви ще нічого не вподобали"
  },

  "auth": {
    "auth": "Сторінка реєстрації",
    "logIn": "Зайти",
    "signIn": "Зареєструватися",
    "submit": "Надіслати",
    "name": "Ім'я",
    "email": "Пошта",
    "password": "Пароль",
    "signInButton": "Зайти",
    "or": "або"
  },

  "personName": {
    "Dmytro": "Дмитро Колєсніков",
    "Tania": "Тетяна Радиховська",
    "Kate": "Катерина Пєхарєва",
    "Sonia": "Соня Пеленська"
  },

  "personDescription": {
    "Dmytro": "Маючи досвід як Fullstack-розробник, я створюю повноцінні вебрішення, що є адаптивними, доступними та зручними в підтримці. Для фронтенду використовую React і Tailwind, а для бекенду — PostgreSQL і Node.js. Стан додатків контролюю за допомогою Redux Toolkit, а в щоденній роботі використовую Git, Vite та Webpack. Ціную співпрацю, ясність у коді та постійний розвиток.",
    "Tania": "Я Fullstack-інженер із фокусом на інтуїтивному дизайні та ефективній архітектурі. Створюю адаптивні вебдодатки на React і Tailwind, працюю зі складним станом за допомогою Redux Toolkit, а також розробляю серверну частину на Node.js та PostgreSQL. Добре володію сучасними інструментами — Git, Webpack, Vite — і ефективно працюю в гнучких Agile-командах. Мене мотивує навчання та реалізація ідей через чистий код.",
    "Kate": "Я Fullstack-розробник, який спеціалізується на створенні адаптивних та зручних у використанні застосунків. Добре володію React і Tailwind для фронтенду, а також Redux Toolkit для керування станом. Маю практичний досвід з Node.js і PostgreSQL на бекенді. Комфортно працюю в Agile-командах та використовую Git, Vite і Webpack. Захоплююся розробкою масштабованих рішень і постійно вдосконалюю свої навички.",
    "Sonia": "Як Fullstack-розробник, я створюю сучасні вебзастосунки, поєднуючи чистий інтерфейс із надійною серверною логікою. Працював з React і Tailwind для побудови фронтенду, а також з Node.js і PostgreSQL на бекенді. Для керування станом використовую Redux Toolkit. Звик працювати за Agile-підходами й добре орієнтуюся в інструментах Git, Vite та Webpack. Мені подобається професійно зростати та реалізовувати ідеї в працюючі рішення."
  },

  "rights": {
    "title": "Права споживача",
    "1": {
      "title": "Повернення та обмін товару",
      "description": "Ви маєте право повернути або обміняти товар протягом 14 днів з моменту покупки, якщо він не був у використанні та збережено товарний вигляд."
    },
    "2": {
      "title": "Гарантія",
      "description": "На всі пристрої надається гарантія терміном від 12 до 24 місяців залежно від моделі. У разі виявлення виробничого дефекту, ми забезпечимо безкоштовне сервісне обслуговування або заміну. Гарантія не поширюється на механічні пошкодження, вплив рідини або несанкціоноване втручання."
    },
    "3": {
      "title": "Інтелектуальна власність",
      "description": "Усі зображення, описи товарів, логотипи та тексти на сайті є власністю нашої компанії або відповідних брендів. Заборонено копіювати або використовувати матеріали без письмової згоди."
    },
    "4": {
      "title": "Відповідальність",
      "description": "Ми не несемо відповідальності за наслідки неправильного використання пристроїв або за дії третіх осіб, до яких ви можете перейти з нашого сайту через зовнішні посилання."
    },
    "5": {
      "title": "Конфіденційність даних",
      "description": "Ми поважаємо вашу конфіденційність. Усі персональні дані, які ви надаєте під час оформлення замовлення, використовуються лише для обробки покупок і не передаються третім особам."
    },
    "6": {
      "title": "Умови доставки",
      "description": "Доставка здійснюється протягом 1–3 робочих днів після підтвердження замовлення. У разі затримки ми обов'язково повідомимо вас заздалегідь."
    },
    "7": {
      "title": "Оплата",
      "description": "Ми приймаємо оплату онлайн (банківські картки), післяплатою або при отриманні. Усі транзакції захищені згідно з сучасними стандартами безпеки."
    },
    "8": {
      "title": "Контакти для звернень",
      "description": "Якщо у вас виникли питання щодо прав споживача, ви можете звернутись до нашої служби підтримки за телефоном +380 (XX) XXX-XX-XX або електронною поштою support@example.com."
    }
  }
}
